#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.cert.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:435552912911:certificate/2e6953ea-c466-4ff3-baa9-7e8c3440affa]
module.policy.aws_iam_role.get_cohort_scenarios_lambda_exec_role: Refreshing state... [id=demo_get_cohort_scenarios_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_metrics_function_object: Refreshing state... [id=lambdas/demo/get_metrics_handler.zip]
module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object: Refreshing state... [id=lambdas/demo/get_company_report_vs_peers_handler.zip]
module.policy.aws_iam_role.add_user_to_customer_group_lambda_exec_role: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role]
module.codebuild.aws_codebuild_source_credential.git_credential: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:token/github]
module.policy.aws_iam_role.glue_trigger_lambda_exec_role: Refreshing state... [id=demo_glue_trigger_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.list_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_list_scenarios_lambda_function]
module.policy.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_logging_function_back]
module.buckets.aws_s3_bucket_object.get_cohort_scenarios_function_object: Refreshing state... [id=lambdas/demo/get_cohort_scenarios_handler.zip]
module.buckets.aws_s3_bucket_object.authorize_function_object: Refreshing state... [id=lambdas/demo/authorize_handler.zip]
module.logs.aws_cloudwatch_log_group.get_cohort_by_id_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_cohort_by_id_lambda_function]
module.logs.aws_cloudwatch_log_group.get_metric_by_id_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metric_by_company_id_lambda_function]
module.logs.aws_cloudwatch_log_group.get_average_metrics_by_cohort_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_average_metrics_by_cohort_lambda_function]
module.logs.aws_cloudwatch_log_group.get_cohort_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_cohort_scenarios_lambda_function]
module.logs.aws_cloudwatch_log_group.get_company_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_lambda_function]
module.logs.aws_cloudwatch_log_group.get_cohorts_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_cohorts_lambda_function]
module.logs.aws_cloudwatch_log_group.authorize_lambda_function: Refreshing state... [id=/aws/lambda/demo_authorize_lambda_function]
module.logs.aws_cloudwatch_log_group.get_average_metrics_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_average_metrics_lambda_function]
module.buckets.aws_s3_bucket_object.get_metric_by_company_id_function_object: Refreshing state... [id=lambdas/demo/get_metric_by_company_id_handler.zip]
module.sql.aws_db_subnet_group.kpinetwork: Refreshing state... [id=demokpinetwork]
module.buckets.aws_s3_bucket_object.get_company_scenarios_function_object: Refreshing state... [id=lambdas/demo/get_company_scenarios_handler.zip]
module.buckets.aws_s3_bucket_object.get_cohort_by_id_function_object: Refreshing state... [id=lambdas/demo/get_cohort_by_id_handler.zip]
module.buckets.aws_s3_bucket_object.get_revenue_sum_by_company_function_object: Refreshing state... [id=lambdas/demo/get_revenue_sum_by_company_handler.zip]
module.buckets.aws_s3_bucket_object.get_scenarios_function_object: Refreshing state... [id=lambdas/demo/get_scenarios_handler.zip]
module.policy.aws_iam_role.get_metric_by_company_id_lambda_exec_role: Refreshing state... [id=demo_get_metric_by_company_id_lambda_exec_role]
module.policy.aws_iam_role.get_cohort_by_id_lambda_exec_role: Refreshing state... [id=demo_get_cohort_by_id_lambda_exec_role]
module.policy.aws_iam_role.get_company_scenarios_lambda_exec_role: Refreshing state... [id=demo_get_company_scenarios_lambda_exec_role]
module.policy.aws_iam_role.get_revenue_sum_by_company_lambda_exec_role: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_exec_role]
module.policy.aws_iam_role.get_scenarios_lambda_exec_role: Refreshing state... [id=demo_get_scenarios_lambda_exec_role]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=kb7gblbu69]
module.policy.aws_lambda_permission.apigw_authorize_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object: Refreshing state... [id=lambdas/demo/get_comparison_vs_peers_handler.zip]
module.policy.aws_iam_role.authorize_lambda_exec_role: Refreshing state... [id=demo_authorize_lambda_exec_role]
module.policy.aws_iam_role.get_metrics_lambda_exec_role: Refreshing state... [id=demo_get_metrics_lambda_exec_role]
module.policy.aws_iam_role.get_average_metrics_lambda_exec_role: Refreshing state... [id=demo_get_average_metrics_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_company_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_scenarios_lambda_function]
module.buckets.aws_s3_bucket_object.etl_script_object: Refreshing state... [id=pyspark/kpinetwork_analizer.py]
module.buckets.aws_s3_bucket_object.get_revenue_sum_by_cohort_function_object: Refreshing state... [id=lambdas/demo/get_revenue_sum_by_cohort_handler.zip]
module.buckets.aws_s3_bucket_object.get_company_function_object: Refreshing state... [id=lambdas/demo/get_company_handler.zip]
module.buckets.aws_s3_bucket_object.get_average_metrics_function_object: Refreshing state... [id=lambdas/demo/get_average_metrics_handler.zip]
module.buckets.aws_s3_bucket_object.get_average_metrics_by_cohort_function_object: Refreshing state... [id=lambdas/demo/get_average_metrics_by_cohort_handler.zip]
module.logs.aws_cloudwatch_log_group.codebuild_rds_migrations: Refreshing state... [id=/aws/codebuild/demo_rds_migrations]
module.buckets.aws_s3_bucket_object.list_scenarios_function_object: Refreshing state... [id=lambdas/demo/list_scenarios_handler.zip]
module.buckets.aws_s3_bucket_object.get_cohorts_function_object: Refreshing state... [id=lambdas/demo/get_cohorts_handler.zip]
aws_route53_zone.kpinetwork: Refreshing state... [id=Z02521762FZPW0IDM8JJO]
module.buckets.aws_s3_bucket_object.glue_trigger_function_object: Refreshing state... [id=lambdas/demo/glue_trigger_handler.zip]
module.logs.aws_cloudwatch_log_group.get_universe_overview_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_universe_overview_lambda_function]
module.logs.aws_cloudwatch_log_group.get_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_scenarios_lambda_function]
module.policy.aws_iam_role.authorize_lambda_invoke_role: Refreshing state... [id=demo_authorize_lambda_invoke_role]
module.policy.aws_iam_role.get_revenue_sum_by_cohort_lambda_exec_role: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_exec_role]
module.policy.aws_iam_role.get_metrics_by_cohort_id_lambda_exec_role: Refreshing state... [id=demo_get_metrics_by_cohort_id_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_metrics_by_cohort_id_function_object: Refreshing state... [id=lambdas/demo/get_metrics_by_cohort_id_handler.zip]
module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object: Refreshing state... [id=lambdas/demo/add_user_to_customer_group_handler.zip]
module.logs.aws_cloudwatch_log_group.get_company_report_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_report_vs_peers_lambda_function]
module.logs.aws_cloudwatch_log_group.get_comparison_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_comparison_vs_peers_lambda_function]
module.logs.aws_cloudwatch_log_group.get_metrics_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metrics_lambda_function]
module.logs.aws_cloudwatch_log_group.get_revenue_sum_by_cohort_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_revenue_sum_by_cohort_lambda_function]
module.logs.aws_cloudwatch_log_group.add_user_to_customer_group_lambda_function: Refreshing state... [id=/aws/lambda/demo_add_user_to_customer_group_lambda_function]
module.buckets.aws_s3_bucket_object.get_all_companies_function_object: Refreshing state... [id=lambdas/demo/get_all_companies_handler.zip]
module.logs.aws_cloudwatch_log_group.get_all_companies_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_all_companies_lambda_function]
module.policy.aws_iam_role.get_company_report_vs_peers_lambda_exec_role: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_revenue_sum_by_company_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_revenue_sum_by_company_lambda_function]
module.policy.aws_iam_role.company_lambda_exec_role: Refreshing state... [id=demo_company_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_metrics_by_cohort_id_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metrics_by_cohort_id_lambda_function]
module.buckets.aws_s3_bucket_object.get_universe_overview_function_object: Refreshing state... [id=lambdas/demo/get_universe_overview_handler.zip]
module.buckets.aws_s3_bucket_object.layer_libraries_object: Refreshing state... [id=layer/demo/layer_libraries.zip]
module.policy.aws_iam_role.get_universe_overview_lambda_exec_role: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role]
module.policy.aws_iam_role.get_cohorts_lambda_exec_role: Refreshing state... [id=demo_get_cohorts_lambda_exec_role]
module.policy.aws_iam_role.list_scenarios_lambda_exec_role: Refreshing state... [id=demo_list_scenarios_lambda_exec_role]
module.policy.aws_iam_role.get_average_metrics_by_cohort_lambda_exec_role: Refreshing state... [id=demo_get_average_metrics_by_cohort_lambda_exec_role]
module.policy.aws_iam_role.companies_lambda_exec_role: Refreshing state... [id=demo_companies_lambda_exec_role]
module.policy.aws_iam_role.get_comparison_vs_peers_lambda_exec_role: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role]
module.policy.aws_iam_policy.lambda_glue_access: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_glue_access]
module.logs.aws_cloudwatch_log_group.glue_trigger_lambda_function: Refreshing state... [id=/aws/lambda/demo_glue_trigger_lambda_function]
module.policy.aws_iam_role_policy_attachment.add_user_to_customer_group_lambda_logs: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role-20220105181813257800000001]
module.policy.aws_iam_role_policy_attachment.get_cohort_scenarios_lambda_logs: Refreshing state... [id=demo_get_cohort_scenarios_lambda_exec_role-20211116152817268600000004]
module.policy.aws_iam_role_policy_attachment.get_cohort_scenarios_lambda_vpc: Refreshing state... [id=demo_get_cohort_scenarios_lambda_exec_role-20211116152817033600000003]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_logs: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916088000000002]
module.sql.aws_db_instance.kpinetwork_db: Refreshing state... [id=demokpinetworkdb]
module.network.aws_api_gateway_resource.metrics: Refreshing state... [id=1cyyi4]
module.network.aws_api_gateway_resource.companies: Refreshing state... [id=bnvar7]
module.network.aws_api_gateway_resource.scenarios: Refreshing state... [id=ifcpo2]
module.network.aws_api_gateway_resource.company_report_vs_peers: Refreshing state... [id=mlpebw]
module.network.aws_api_gateway_resource.cohorts: Refreshing state... [id=97prpe]
module.network.aws_api_gateway_resource.comparison_vs_peers: Refreshing state... [id=ygo84c]
module.network.aws_api_gateway_resource.universe_overview: Refreshing state... [id=zr5b6w]
module.policy.aws_iam_role_policy_attachment.get_metric_by_id_lambda_vpc: Refreshing state... [id=demo_get_metric_by_company_id_lambda_exec_role-20211110195232341900000001]
module.policy.aws_iam_role_policy_attachment.get_metric_by_company_id_lambda_logs: Refreshing state... [id=demo_get_metric_by_company_id_lambda_exec_role-20211110195232357400000002]
module.policy.aws_iam_role_policy_attachment.get_cohort_by_id_lambda_logs: Refreshing state... [id=demo_get_cohort_by_id_lambda_exec_role-20211116152817488400000005]
module.policy.aws_iam_role_policy_attachment.get_cohort_by_id_lambda_vpc: Refreshing state... [id=demo_get_cohort_by_id_lambda_exec_role-20211116152817567900000006]
module.policy.aws_iam_role_policy_attachment.company_scenarios_lambda_vpc: Refreshing state... [id=demo_get_company_scenarios_lambda_exec_role-20211111170238922300000004]
module.policy.aws_iam_role_policy_attachment.company_scenarios_lambda_logs: Refreshing state... [id=demo_get_company_scenarios_lambda_exec_role-20211111170238921300000003]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_company_lambda_logs: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_exec_role-20211115215557782400000002]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_company_lambda_vpc: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_exec_role-20211115215557782000000001]
module.policy.aws_iam_role_policy_attachment.scenarios_lambda_vpc: Refreshing state... [id=demo_get_scenarios_lambda_exec_role-20211125180844570400000002]
module.policy.aws_iam_role_policy_attachment.scenarios_lambda_logs: Refreshing state... [id=demo_get_scenarios_lambda_exec_role-20211125180844569300000001]
module.policy.aws_iam_role_policy_attachment.authorize_lambda_logs: Refreshing state... [id=demo_authorize_lambda_exec_role-20220113125137753300000001]
module.policy.aws_iam_role_policy_attachment.get_metrics_lambda_logs: Refreshing state... [id=demo_get_metrics_lambda_exec_role-20211110194402226000000002]
module.policy.aws_iam_role_policy_attachment.get_metrics_lambda_vpc: Refreshing state... [id=demo_get_metrics_lambda_exec_role-20211110194402192800000001]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_lambda_vpc: Refreshing state... [id=demo_get_average_metrics_lambda_exec_role-20211122220041443600000003]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_lambda_logs: Refreshing state... [id=demo_get_average_metrics_lambda_exec_role-20211122220041624400000004]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_cohort_lambda_logs: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_exec_role-20211122220041296600000001]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_cohort_lambda_vpc: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_exec_role-20211122220041371600000002]
module.policy.aws_iam_role_policy_attachment.get_metrics_by_cohort_id_lambda_logs: Refreshing state... [id=demo_get_metrics_by_cohort_id_lambda_exec_role-20211125134234575000000004]
module.policy.aws_iam_role_policy_attachment.get_metrics_by_cohort_id_lambda_vpc: Refreshing state... [id=demo_get_metrics_by_cohort_id_lambda_exec_role-20211125134234097000000001]
module.policy.aws_iam_role_policy.authorize_lambda_invoke_policy: Refreshing state... [id=demo_authorize_lambda_invoke_role:demo_authorize_lambda_invoke_policy]
module.policy.aws_iam_role_policy_attachment.get_company_report_vs_peers_lambda_logs: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role-20211217193844110800000001]
module.policy.aws_iam_role_policy_attachment.get_company_report_vs_peers_lambda_vpc: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role-20211217193844121400000002]
module.policy.aws_iam_role_policy_attachment.company_lambda_vpc: Refreshing state... [id=demo_company_lambda_exec_role-20211104145749000900000003]
module.policy.aws_iam_role_policy_attachment.company_lambda_logs: Refreshing state... [id=demo_company_lambda_exec_role-20211104145749000100000002]
module.policy.aws_iam_role_policy_attachment.get_universe_overview_lambda_vpc: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20211209154733547200000002]
module.policy.aws_iam_role_policy_attachment.get_universe_overview_lambda_logs: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20211209154733547100000001]
module.dns.aws_route53_record.cert_validations[1]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.dns.aws_route53_record.cert_validations[0]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.policy.aws_iam_role_policy_attachment.get_cohorts_lambda_vpc: Refreshing state... [id=demo_get_cohorts_lambda_exec_role-20211116152816484600000001]
module.policy.aws_iam_role_policy_attachment.get_cohorts_lambda_logs: Refreshing state... [id=demo_get_cohorts_lambda_exec_role-20211116152816576300000002]
module.policy.aws_iam_role_policy_attachment.list_scenarios_lambda_logs: Refreshing state... [id=demo_list_scenarios_lambda_exec_role-20211111170237751100000001]
module.policy.aws_iam_role_policy_attachment.list_scenarios_lambda_vpc: Refreshing state... [id=demo_list_scenarios_lambda_exec_role-20211111170238199900000002]
module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment: Refreshing state... [id=a4joms]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_by_cohort_lambda_logs: Refreshing state... [id=demo_get_average_metrics_by_cohort_lambda_exec_role-20211125134234098900000002]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_by_cohort_lambda_vpc: Refreshing state... [id=demo_get_average_metrics_by_cohort_lambda_exec_role-20211125134234099900000003]
module.policy.aws_iam_role_policy_attachment.get_comparison_vs_peers_lambda_vpc: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role-20211222131917590600000002]
module.policy.aws_iam_role_policy_attachment.get_comparison_vs_peers_lambda_logs: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role-20211222131917584000000001]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_glue_access: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916085000000001]
module.network.aws_api_gateway_resource.company_metric: Refreshing state... [id=2ty0vw]
module.network.aws_api_gateway_resource.company_revenue: Refreshing state... [id=cl0jnm]
module.network.aws_api_gateway_resource.metric_cohort: Refreshing state... [id=fjgqv3]
module.network.aws_api_gateway_resource.company: Refreshing state... [id=sjvaet]
module.network.aws_api_gateway_resource.scenarios_list: Refreshing state... [id=tp2zxu]
module.network.aws_api_gateway_resource.scenario_company: Refreshing state... [id=z01lfb]
module.policy.aws_iam_role_policy_attachment.companies_lambda_logs: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145749002900000004]
module.policy.aws_iam_role_policy_attachment.companies_lambda_vpc: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145748993600000001]
module.network.aws_api_gateway_resource.cohort: Refreshing state... [id=5k8zew]
module.network.aws_api_gateway_resource.cohort_revenue: Refreshing state... [id=pymy9y]
module.network.aws_api_gateway_resource.company_report_vs_peers_id: Refreshing state... [id=wycmf0]
module.network.aws_api_gateway_resource.comparison_vs_peers_id: Refreshing state... [id=jtuqjb]
module.functions.aws_lambda_layer_version.db_lambda_layer: Refreshing state... [id=arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:4]
module.network.aws_api_gateway_resource.metric: Refreshing state... [id=k9hbzo]
module.functions.aws_lambda_function.glue_trigger_lambda_function: Refreshing state... [id=demo_glue_trigger_lambda_function]
module.network.aws_api_gateway_resource.metric_cohort_id: Refreshing state... [id=rr716m]
module.network.aws_api_gateway_resource.scenarios_company_id: Refreshing state... [id=znsrwp]
module.codebuild.aws_codebuild_project.rds_migrations: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:project/demo_rds_migrations]
module.network.aws_api_gateway_resource.cohort_scenarios: Refreshing state... [id=63z04b]
module.cert.aws_acm_certificate_validation.cert: Refreshing state... [id=2021-10-15 14:52:46 +0000 UTC]
module.functions.aws_lambda_function.get_cohort_by_id_function: Refreshing state... [id=demo_get_cohort_by_id_lambda_function]
module.functions.aws_lambda_function.list_scenarios_lambda_function: Refreshing state... [id=demo_list_scenarios_lambda_function]
module.functions.aws_lambda_function.get_average_metrics_by_cohort_function: Refreshing state... [id=demo_get_average_metrics_by_cohort_lambda_function]
module.functions.aws_lambda_function.get_average_metrics_function: Refreshing state... [id=demo_get_average_metrics_lambda_function]
module.functions.aws_lambda_function.get_universe_overview_lambda_function: Refreshing state... [id=demo_get_universe_overview_lambda_function]
module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_function]
module.functions.aws_lambda_function.get_metrics_by_cohort_id_function: Refreshing state... [id=demo_get_metrics_by_cohort_id_lambda_function]
module.functions.aws_lambda_function.get_all_companies_lambda_function: Refreshing state... [id=demo_get_all_companies_lambda_function]
module.functions.aws_lambda_function.get_revenue_sum_by_cohort_lambda_function: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_function]
module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_function]
module.functions.aws_lambda_function.get_revenue_sum_by_company_lambda_function: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_function]
module.functions.aws_lambda_function.get_company_scenarios_lambda_function: Refreshing state... [id=demo_get_company_scenarios_lambda_function]
module.functions.aws_lambda_function.get_cohorts_scenarios_function: Refreshing state... [id=demo_get_cohort_scenarios_lambda_function]
module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function: Refreshing state... [id=demo_add_user_to_customer_group_lambda_function]
module.functions.aws_lambda_function.get_company_lambda_function: Refreshing state... [id=demo_get_company_lambda_function]
module.functions.aws_lambda_function.get_scenarios_lambda_function: Refreshing state... [id=demo_get_scenarios_lambda_function]
module.functions.aws_lambda_function.get_metric_by_company_id_function: Refreshing state... [id=demo_get_metric_by_company_id_lambda_function]
module.functions.aws_lambda_function.get_cohorts_function: Refreshing state... [id=demo_get_cohorts_lambda_function]
module.functions.aws_lambda_function.get_metrics_function: Refreshing state... [id=demo_get_metrics_lambda_function]
module.network.aws_api_gateway_resource.average_metrics: Refreshing state... [id=ww2zcl]
module.network.aws_api_gateway_resource.cohort_metrics: Refreshing state... [id=rtzpd4]
module.network.aws_api_gateway_resource.cohort_average_metric: Refreshing state... [id=hdyvp6]
module.functions.aws_lambda_permission.glue_trigger_event_permission: Refreshing state... [id=AllowExecutionFromS3Bucket]
module.network.aws_api_gateway_domain_name.domain: Refreshing state... [id=api.demo.kpinetwork.com]
module.cognito.aws_cognito_user_pool.pool: Refreshing state... [id=us-west-2_usXw4S12D]
module.functions.aws_s3_bucket_notification.files_bucket_notification: Refreshing state... [id=kpinetwork-files]
module.network.aws_api_gateway_base_path_mapping.domain_mapping: Refreshing state... [id=api.demo.kpinetwork.com/]
module.dns.aws_route53_record.kpinetwork_domain: Refreshing state... [id=Z02521762FZPW0IDM8JJO_api.demo.kpinetwork.com_A]
module.cognito.aws_cognito_user_group.admin: Refreshing state... [id=us-west-2_usXw4S12D/demo_admin_group]
module.cognito.aws_cognito_user_group.customer: Refreshing state... [id=us-west-2_usXw4S12D/demo_customer_group]
module.cognito.aws_lambda_permission.allow_post_confirmation_from_user_pool: Refreshing state... [id=AllowPostConfirmationFromUserPool]
module.policy.aws_iam_policy.add_user_to_customer_group_policy: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_post_configuration_trigger_policy]
module.cognito.aws_cognito_user_pool_client.amplify: Refreshing state... [id=3917dpipsnpi2i8uofiovmn2jr]
module.functions.aws_lambda_function.authorize_lambda_function: Refreshing state... [id=demo_authorize_lambda_function]
module.policy.aws_iam_role_policy_attachment.add_user_to_customer_group_lambda_cognito_policy: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role-20220107163139048600000001]
module.network.aws_api_gateway_authorizer.kpi_authorizer: Refreshing state... [id=3y14fs]
module.network.aws_api_gateway_method.get_metrics_method: Refreshing state... [id=agm-kb7gblbu69-1cyyi4-GET]
module.network.aws_api_gateway_method.get_cohort_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-63z04b-GET]
module.network.aws_api_gateway_method.get_company_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-znsrwp-GET]
module.network.aws_api_gateway_method.get_metrics_by_cohort_id_method: Refreshing state... [id=agm-kb7gblbu69-rtzpd4-GET]
module.network.aws_api_gateway_method.get_average_metrics_by_cohort_method: Refreshing state... [id=agm-kb7gblbu69-hdyvp6-GET]
module.network.aws_api_gateway_method.get_company_report_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-wycmf0-GET]
module.network.aws_api_gateway_method.get_comparison_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-jtuqjb-GET]
module.network.aws_api_gateway_method.get_metric_by_company_id_method: Refreshing state... [id=agm-kb7gblbu69-k9hbzo-GET]
module.network.aws_api_gateway_method.get_cohorts_method: Refreshing state... [id=agm-kb7gblbu69-97prpe-GET]
module.network.aws_api_gateway_method.get_cohort_by_id_method: Refreshing state... [id=agm-kb7gblbu69-5k8zew-GET]
module.network.aws_api_gateway_method.list_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-tp2zxu-GET]
module.network.aws_api_gateway_method.get_revenue_sum_by_company_method: Refreshing state... [id=agm-kb7gblbu69-cl0jnm-GET]
module.network.aws_api_gateway_method.get_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-ifcpo2-GET]
module.network.aws_api_gateway_method.get_all_companies_method: Refreshing state... [id=agm-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_method.get_company_method: Refreshing state... [id=agm-kb7gblbu69-sjvaet-GET]
module.network.aws_api_gateway_method.get_average_metrics_method: Refreshing state... [id=agm-kb7gblbu69-ww2zcl-GET]
module.network.aws_api_gateway_method.get_universe_overview_method: Refreshing state... [id=agm-kb7gblbu69-zr5b6w-GET]
module.network.aws_api_gateway_method.get_revenue_sum_by_cohort_method: Refreshing state... [id=agm-kb7gblbu69-pymy9y-GET]
module.network.aws_api_gateway_integration.company_scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-znsrwp-GET]
module.network.aws_api_gateway_integration.cohort_average_metrics_integration: Refreshing state... [id=agi-kb7gblbu69-hdyvp6-GET]
module.network.aws_api_gateway_integration.cohort_scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-63z04b-GET]
module.network.aws_api_gateway_integration.comparison_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-jtuqjb-GET]
module.network.aws_api_gateway_integration.metrics_by_cohort_id_integration: Refreshing state... [id=agi-kb7gblbu69-rtzpd4-GET]
module.network.aws_api_gateway_integration.metric_by_company_id_integration: Refreshing state... [id=agi-kb7gblbu69-k9hbzo-GET]
module.network.aws_api_gateway_integration.company_report_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-wycmf0-GET]
module.network.aws_api_gateway_integration.cohorts_integration: Refreshing state... [id=agi-kb7gblbu69-97prpe-GET]
module.network.aws_api_gateway_integration.cohort_by_id_integration: Refreshing state... [id=agi-kb7gblbu69-5k8zew-GET]
module.network.aws_api_gateway_integration.metrics_integration: Refreshing state... [id=agi-kb7gblbu69-1cyyi4-GET]
module.network.aws_api_gateway_integration.scenarios_list_integration: Refreshing state... [id=agi-kb7gblbu69-tp2zxu-GET]
module.network.aws_api_gateway_integration.companies_integration: Refreshing state... [id=agi-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_integration.company_integration: Refreshing state... [id=agi-kb7gblbu69-sjvaet-GET]
module.network.aws_api_gateway_integration.universe_overview_integration: Refreshing state... [id=agi-kb7gblbu69-zr5b6w-GET]
module.network.aws_api_gateway_integration.revenue_sum_by_cohort_integration: Refreshing state... [id=agi-kb7gblbu69-pymy9y-GET]
module.network.aws_api_gateway_integration.revenue_sum_by_company_integration: Refreshing state... [id=agi-kb7gblbu69-cl0jnm-GET]
module.network.aws_api_gateway_integration.average_metrics_integration: Refreshing state... [id=agi-kb7gblbu69-ww2zcl-GET]
module.network.aws_api_gateway_integration.scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-ifcpo2-GET]
module.policy.aws_lambda_permission.apigw_get_company_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetCompanyScenarios]
module.policy.aws_lambda_permission.apigw_get_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetScenarios]
module.policy.aws_lambda_permission.apigw_get_metrics_by_cohort_id_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCohortId]
module.policy.aws_lambda_permission.apigw_get_company_report_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_get_average_metrics_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayAverage]
module.policy.aws_lambda_permission.apigw_get_metrics_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_list_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayListScenarios]
module.policy.aws_lambda_permission.apigw_get_cohorts_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_cohort_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_cohort_by_id_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_metric_by_company_id_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_universe_overview_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_get_company_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_revenue_sum_by_cohort_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRevenueSum]
module.policy.aws_lambda_permission.apigw_get_all_companies_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_comparison_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_get_revenue_sum_by_company_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRevenueSum]
module.policy.aws_lambda_permission.apigw_get_average_metrics_by_cohort_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCohortAverage]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.functions.aws_lambda_function.authorize_lambda_function has changed
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-01-13T16:19:52.000+0000" -> "2022-01-13T16:35:20.000+0000"
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:4",
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:5",
        ]
      ~ source_code_hash               = "OE0bQ3QtRkpOE2exK4V+Iyg4ttFFPtNjWcEtQ97dVgU=" -> "myAmWP5mPCdWMZgW6yXf8Y7YGmVpj5Una/ORnXco1lI="
      ~ source_code_size               = 1311 -> 1258
        tags                           = {}
        # (22 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.policy.aws_iam_role.authorize_lambda_invoke_role has changed
  ~ resource "aws_iam_role" "authorize_lambda_invoke_role" {
        id                    = "demo_authorize_lambda_invoke_role"
        name                  = "demo_authorize_lambda_invoke_role"
        tags                  = {}
        # (10 unchanged attributes hidden)

      - inline_policy {
          - name   = "demo_authorize_lambda_invoke_policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "lambda:InvokeFunction"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:lambda:us-west-2:435552912911:function:authorize_lambda_function"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      + inline_policy {
          + name   = "demo_authorize_lambda_invoke_policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "lambda:InvokeFunction"
                          + Effect   = "Allow"
                          + Resource = "arn:aws:lambda:us-west-2:435552912911:function:demo_authorize_lambda_function"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "7c6cf66fef493d4a2235de8efba6e1fa" -> "3b4fb1147aa565de49c26104a2b0c5cc"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "462183c4ebc52669b610ac91d428e230" -> "8edf6aeec05d84efc65d9a83bead8775"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "5401d00bb8cefcf2d042c71e9b98e428" -> "9f289552d9b6eeb26f56611b12a8d673"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_average_metrics_by_cohort_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_average_metrics_by_cohort_function_object" {
      ~ etag               = "e744335c8dd1da0e99518fa42af10afd" -> "2097938c7ecff251616c9f37fd9a9a03"
        id                 = "lambdas/demo/get_average_metrics_by_cohort_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_average_metrics_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_average_metrics_function_object" {
      ~ etag               = "2d698dc04a49b2a8587cf25afbb3bb0f" -> "f94a2bcf2709602d8a8ca60ecd7a6bae"
        id                 = "lambdas/demo/get_average_metrics_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_cohort_by_id_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_cohort_by_id_function_object" {
      ~ etag               = "6d28734813cef224b097a0f3fc5edeb4" -> "c47f33c6b9dcae7c7e7e5502ec8d613b"
        id                 = "lambdas/demo/get_cohort_by_id_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_cohort_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_cohort_scenarios_function_object" {
      ~ etag               = "d30be3072ec19a8598b4b9070c04e0ec" -> "487ca0eb40b088549fa3c97241d44d16"
        id                 = "lambdas/demo/get_cohort_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_cohorts_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_cohorts_function_object" {
      ~ etag               = "627ba66332997831fa9c14210009d4ff" -> "3e7b7cdbe834ee90bcace02036ca557b"
        id                 = "lambdas/demo/get_cohorts_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_function_object" {
      ~ etag               = "452cd66c3e3f6d5c64ca00e2d11ed5d8" -> "be17f5d2673f4ae226c807544762fe51"
        id                 = "lambdas/demo/get_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "f8c382d23b2461e861b9186f030fa22d" -> "ea4495d6180eafe36845a7c6863c4261"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_scenarios_function_object" {
      ~ etag               = "a849f947bdfd9cc2bdad63d5f638e64d" -> "a6c81d33f60f9551d4145a8002034e87"
        id                 = "lambdas/demo/get_company_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "2f56a543a8ea3c9c2729d18474e90fef" -> "c20768bc0a4925093520933bd036892a"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_by_company_id_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_by_company_id_function_object" {
      ~ etag               = "0c1dc15bf4a97b4d2265b3de3a7369c1" -> "6124280481968bcc5b646c8c674cc18b"
        id                 = "lambdas/demo/get_metric_by_company_id_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metrics_by_cohort_id_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metrics_by_cohort_id_function_object" {
      ~ etag               = "d08dd96e334556f6f11f65cbcc558853" -> "7c0bfb90709a9a7973bde7e13f0cbda7"
        id                 = "lambdas/demo/get_metrics_by_cohort_id_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metrics_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metrics_function_object" {
      ~ etag               = "a366459e8c037e8f3ae37ff3840d04dc" -> "5112f68d96c59e6f9fb5e50e9c44e544"
        id                 = "lambdas/demo/get_metrics_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_revenue_sum_by_cohort_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_revenue_sum_by_cohort_function_object" {
      ~ etag               = "7f8a087e15a96159adcaf59710591f76" -> "27ec6cfeb01d1ce46d2a5d320e146ebc"
        id                 = "lambdas/demo/get_revenue_sum_by_cohort_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_revenue_sum_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_revenue_sum_by_company_function_object" {
      ~ etag               = "9c41f0524476e86d73c2bd717655ceb3" -> "c79248386466f9470446f40c0b4dfe6d"
        id                 = "lambdas/demo/get_revenue_sum_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_scenarios_function_object" {
      ~ etag               = "51622274cbaa7847a2bf148224de1226" -> "757134e45634c7ce7e5d4df51133f076"
        id                 = "lambdas/demo/get_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "25f500c44e161ce2367bf5a50fa30a26" -> "6aa70633dac170da4e3f0f314ed62cfa"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "b71a70adebb2ab03f18f76045c66ac91" -> "8d1a20eb63acb3fd38f63836edee03c1"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "961f83cb4fa65709d0649e56993c4e07" -> "8b1094855f05674de04c64be899e0853"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.list_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "list_scenarios_function_object" {
      ~ etag               = "755b00c4bff43259a9916447b092d370" -> "849f6a9f59930efab26f3c72b94c0435"
        id                 = "lambdas/demo/list_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-01-13T16:19:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "4acgQmet8K0QfNRXngsom09OU7hoOvV9DtQ7hyak6Ik=" -> "ZDbZVWzkBSAjAG+cPGN7q20FlunFAcNfLY/xOAFxPko="
        tags                           = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-01-13T16:35:20.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:5",
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:4",
        ]
      ~ source_code_hash               = "myAmWP5mPCdWMZgW6yXf8Y7YGmVpj5Una/ORnXco1lI=" -> "3WGeJ35DJlkSKkQsS8VeaWvry4+4NtfH4cU0hqx8UhU="
        tags                           = {}
        # (23 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-01-13T16:19:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "LKBwyeV4pDNOe+Z4sLaWAgUnGa6CTxwunDKhkZQcDkk=" -> "SXo3h4a8V5m3ftWFDiVBcK85D+yKJ45WRBXBKJQXsaU="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_average_metrics_by_cohort_function will be updated in-place
  ~ resource "aws_lambda_function" "get_average_metrics_by_cohort_function" {
        id                             = "demo_get_average_metrics_by_cohort_lambda_function"
      ~ last_modified                  = "2022-01-13T16:20:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "HAF866FgwfOzjOkwysLf6ZanLFDkl9sZycM8AzStSOs=" -> "QK1H0O9n7R47x98/qidyJTbYPBdpEvGtjtYFlC7Zeo8="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_average_metrics_function will be updated in-place
  ~ resource "aws_lambda_function" "get_average_metrics_function" {
        id                             = "demo_get_average_metrics_lambda_function"
      ~ last_modified                  = "2022-01-13T16:19:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "597IZwJcV/Z2g7Dc0ZsF14Nydsahaf4Pc/Vd+LrFghY=" -> "+NWoJUfGzLp8tGKsAqvVcDWT2vzRDv9ikk82jmsLhuo="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_cohort_by_id_function will be updated in-place
  ~ resource "aws_lambda_function" "get_cohort_by_id_function" {
        id                             = "demo_get_cohort_by_id_lambda_function"
      ~ last_modified                  = "2022-01-13T16:20:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "lMTwcbL0Xtf36u/t2fhsySG2dOiVMQvHyY+MRGICXew=" -> "MEzeHgEWYtTZYfiDMy4P3lF0VbmgKV6vI6xveFWoV5s="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_cohorts_function will be updated in-place
  ~ resource "aws_lambda_function" "get_cohorts_function" {
        id                             = "demo_get_cohorts_lambda_function"
      ~ last_modified                  = "2022-01-13T16:20:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "ANGc/+PXGfBj5/cP11nnFz3yf/2W4GHzXR9PDjLPHVo=" -> "t6LWwWvqKVTGzA2asovg87UwD+E2IIVtOdfbvpiJCis="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_cohorts_scenarios_function will be updated in-place
  ~ resource "aws_lambda_function" "get_cohorts_scenarios_function" {
        id                             = "demo_get_cohort_scenarios_lambda_function"
      ~ last_modified                  = "2022-01-13T16:20:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "7GfAeuFMSOfPSKFuZdTf1OS0i+ziLL6gcpmSrUfHAH0=" -> "Ee2HghE5Vs/zPkP2zONbUKwy1EibDxX63oR4YbUs2NE="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_lambda_function" {
        id                             = "demo_get_company_lambda_function"
      ~ last_modified                  = "2022-01-13T16:19:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "29ZvDtiwh6TZ1aTctlBy5h49VJHdIN6cl3eRRTtimIY=" -> "I6EbEV/XRJvhPgHc8D4oSPCulCWkFMEL2gxJD4nVPuo="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-01-13T16:19:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "OU4DpZ0tYDDxbo6eadtbKgn0HfYB/jHqj1XC1Lg0QQs=" -> "eokf8zQO+cOK+RO0H+9tuWck7OCqxOTD34BdYNgc3A4="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_scenarios_lambda_function" {
        id                             = "demo_get_company_scenarios_lambda_function"
      ~ last_modified                  = "2022-01-13T16:20:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "9qtFTIQsCa4U8NtjQ2PNTo8oYpnwDXzYBncqmdhqm2s=" -> "LhOj2j2EkJ8cvyc93W0Z8w0ibrrPiX1vwlCpQMmLmME="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-01-13T16:19:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "t66SSjrfyLcrvCPFb3WBYBBnexlfoDe3Tl/LYuKUAJ8=" -> "W2kHjRAfFMj8BNYzlxaQwA7MHNzCUEBWdmzNc6Pn5Vo="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_by_company_id_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_by_company_id_function" {
        id                             = "demo_get_metric_by_company_id_lambda_function"
      ~ last_modified                  = "2022-01-13T16:19:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "sReyxQU6kapgQZDM3Jcm0iUW7TsL9g1umhKabyp7qcs=" -> "bopT3nmst4+QLC1LLzsfDKSv/R22z/ggSdn2dg+eUQ0="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metrics_by_cohort_id_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metrics_by_cohort_id_function" {
        id                             = "demo_get_metrics_by_cohort_id_lambda_function"
      ~ last_modified                  = "2022-01-13T16:19:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "onSpfoxHopTMzVQKuvoRYw2jVTKEaqT6m3N6BFl6Xxc=" -> "mg2noGOUR0zFn8CFedlynRkqnlj5l4zhNVQQ1qhYIwk="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metrics_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metrics_function" {
        id                             = "demo_get_metrics_lambda_function"
      ~ last_modified                  = "2022-01-13T16:19:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "6E9w9E0YCG9DpY5WGVnAf07s/olyQNZgB5queFGVLhk=" -> "tFUlgriYBJfV0rATNRR/DuyQoAMGw2VBjlT59Gx0gOk="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_revenue_sum_by_cohort_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_revenue_sum_by_cohort_lambda_function" {
        id                             = "demo_get_revenue_sum_by_cohort_lambda_function"
      ~ last_modified                  = "2022-01-13T16:20:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "QHAYdxCg4a6NsX1+7r4aykOqzLykwzeiiNRqKSksXsA=" -> "0O9Ahez3pit19lE1gXvi2fCL2LhJdoc+q8NesrqO7vY="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_revenue_sum_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_revenue_sum_by_company_lambda_function" {
        id                             = "demo_get_revenue_sum_by_company_lambda_function"
      ~ last_modified                  = "2022-01-13T16:20:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "ljUwsOck2Z+7eXs1fOQWHjQnWllin239CMLUlIFISXY=" -> "d5Dt6EPhrwKMucKiPrrHZhaGQj6PrOzqIIFH+qm0P3U="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_scenarios_lambda_function" {
        id                             = "demo_get_scenarios_lambda_function"
      ~ last_modified                  = "2022-01-13T16:20:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "/wNKvJj5an3TFG41ONnpyukvBMM3JC+udNHFv2vPh2Y=" -> "ZQuJYJwfJp8jMo3S87ukjyhENshbyTO62hafwdsyCFs="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-01-13T16:20:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "Jyx83X+GKkIQuAFZbEhEJBbwzXbPDtTF/dcFANgKOj0=" -> "GKYAy6fdoak5RdRLJ9AsOf1OnPlG1UMA0SMXW9G0Ztk="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-01-13T16:20:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "2iA9fOAWhiRnn2y5aqdylO5YZPclsQqw7rHlNjhfXaA=" -> "tp9/Spx0UGNtM1eUMFAdx3D++sGFu+USd/tJUs2uQ7I="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.list_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "list_scenarios_lambda_function" {
        id                             = "demo_list_scenarios_lambda_function"
      ~ last_modified                  = "2022-01-13T16:20:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "cdHgCiV903T2ji5k99hCMSgWrsqnEqDWSGIk3J6fJKo=" -> "S/W1ncqMR9YrrDPTI+xI6rRg+NZOCQD/pC8M1BEJUNc="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-01-13T16:19:47Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "a4joms" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-01-13T16:19:46Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_all_companies_method will be updated in-place
  ~ resource "aws_api_gateway_method" "get_all_companies_method" {
      ~ authorization        = "NONE" -> "CUSTOM"
      + authorizer_id        = "3y14fs"
        id                   = "agm-kb7gblbu69-bnvar7-GET"
        # (7 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_average_metrics_by_cohort_method will be updated in-place
  ~ resource "aws_api_gateway_method" "get_average_metrics_by_cohort_method" {
      ~ authorization        = "NONE" -> "CUSTOM"
      + authorizer_id        = "3y14fs"
        id                   = "agm-kb7gblbu69-hdyvp6-GET"
        # (7 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_average_metrics_method will be updated in-place
  ~ resource "aws_api_gateway_method" "get_average_metrics_method" {
      ~ authorization        = "NONE" -> "CUSTOM"
      + authorizer_id        = "3y14fs"
        id                   = "agm-kb7gblbu69-ww2zcl-GET"
        # (7 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_cohort_by_id_method will be updated in-place
  ~ resource "aws_api_gateway_method" "get_cohort_by_id_method" {
      ~ authorization        = "NONE" -> "CUSTOM"
      + authorizer_id        = "3y14fs"
        id                   = "agm-kb7gblbu69-5k8zew-GET"
        # (7 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_cohort_scenarios_method will be updated in-place
  ~ resource "aws_api_gateway_method" "get_cohort_scenarios_method" {
      ~ authorization        = "NONE" -> "CUSTOM"
      + authorizer_id        = "3y14fs"
        id                   = "agm-kb7gblbu69-63z04b-GET"
        # (7 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_cohorts_method will be updated in-place
  ~ resource "aws_api_gateway_method" "get_cohorts_method" {
      ~ authorization        = "NONE" -> "CUSTOM"
      + authorizer_id        = "3y14fs"
        id                   = "agm-kb7gblbu69-97prpe-GET"
        # (7 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_company_method will be updated in-place
  ~ resource "aws_api_gateway_method" "get_company_method" {
      ~ authorization        = "NONE" -> "CUSTOM"
      + authorizer_id        = "3y14fs"
        id                   = "agm-kb7gblbu69-sjvaet-GET"
        # (7 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_company_report_vs_peers_method will be updated in-place
  ~ resource "aws_api_gateway_method" "get_company_report_vs_peers_method" {
      ~ authorization        = "NONE" -> "CUSTOM"
      + authorizer_id        = "3y14fs"
        id                   = "agm-kb7gblbu69-wycmf0-GET"
        # (7 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_company_scenarios_method will be updated in-place
  ~ resource "aws_api_gateway_method" "get_company_scenarios_method" {
      ~ authorization        = "NONE" -> "CUSTOM"
      + authorizer_id        = "3y14fs"
        id                   = "agm-kb7gblbu69-znsrwp-GET"
        # (7 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_comparison_vs_peers_method will be updated in-place
  ~ resource "aws_api_gateway_method" "get_comparison_vs_peers_method" {
      ~ authorization        = "NONE" -> "CUSTOM"
      + authorizer_id        = "3y14fs"
        id                   = "agm-kb7gblbu69-jtuqjb-GET"
        # (7 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_metric_by_company_id_method will be updated in-place
  ~ resource "aws_api_gateway_method" "get_metric_by_company_id_method" {
      ~ authorization        = "NONE" -> "CUSTOM"
      + authorizer_id        = "3y14fs"
        id                   = "agm-kb7gblbu69-k9hbzo-GET"
        # (7 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_metrics_by_cohort_id_method will be updated in-place
  ~ resource "aws_api_gateway_method" "get_metrics_by_cohort_id_method" {
      ~ authorization        = "NONE" -> "CUSTOM"
      + authorizer_id        = "3y14fs"
        id                   = "agm-kb7gblbu69-rtzpd4-GET"
        # (7 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_metrics_method will be updated in-place
  ~ resource "aws_api_gateway_method" "get_metrics_method" {
      ~ authorization        = "NONE" -> "CUSTOM"
      + authorizer_id        = "3y14fs"
        id                   = "agm-kb7gblbu69-1cyyi4-GET"
        # (7 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_revenue_sum_by_cohort_method will be updated in-place
  ~ resource "aws_api_gateway_method" "get_revenue_sum_by_cohort_method" {
      ~ authorization        = "NONE" -> "CUSTOM"
      + authorizer_id        = "3y14fs"
        id                   = "agm-kb7gblbu69-pymy9y-GET"
        # (7 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_revenue_sum_by_company_method will be updated in-place
  ~ resource "aws_api_gateway_method" "get_revenue_sum_by_company_method" {
      ~ authorization        = "NONE" -> "CUSTOM"
      + authorizer_id        = "3y14fs"
        id                   = "agm-kb7gblbu69-cl0jnm-GET"
        # (7 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_scenarios_method will be updated in-place
  ~ resource "aws_api_gateway_method" "get_scenarios_method" {
      ~ authorization        = "NONE" -> "CUSTOM"
      + authorizer_id        = "3y14fs"
        id                   = "agm-kb7gblbu69-ifcpo2-GET"
        # (7 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_universe_overview_method will be updated in-place
  ~ resource "aws_api_gateway_method" "get_universe_overview_method" {
      ~ authorization        = "NONE" -> "CUSTOM"
      + authorizer_id        = "3y14fs"
        id                   = "agm-kb7gblbu69-zr5b6w-GET"
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 60 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*